Peng Lin-resume.org
#+STARTUP: showall
#+OPTIONS: toc:nil h:4 num:nil
#+LaTeX_CLASS: article
#+LATEX_CLASS_OPTIONS: [10pt, a4paper]
#+LaTeX_HEADER: \usepackage[margin=0.75in]{geometry}
#+LaTeX_HEADER: \usepackage{tabularx}
#+LaTeX_HEADER: \usepackage{sectsty}
#+LaTeX_HEADER: \usepackage{color}
#+LaTeX_HEADER: \definecolor{linkcolour}{rgb}{0,0.2,0.6}
#+LaTeX_HEADER: \hypersetup{colorlinks,breaklinks, urlcolor=linkcolour,linkcolor=linkcolour}

#+BEGIN_LATEX
\pagestyle{empty}
\setlength{\parindent}{0cm}

\sectionfont{
  \huge\bfseries
}

\subsectionfont{
  \sectionrule{0pt}{0pt}{-5pt}{0.8pt}
}
#+END_LATEX

#+TITLE:

#+MACRO: name Peng Lin
#+MACRO: addrln1 School of Electrical Engineering & Computer Science Washington State University PO Box 642752 Pullman WA 99164-2752
#+MACRO: addrln2 Pullman, WA, 99163
#+MACRO: email [[mailto:penglin03@gmail.com][penglin03@gmail.com]]
#+MACRO: phone +86 189 1852 2776
#+MACRO: link penglin03.github.io

* {{{name}}}
#+ATTR_LaTeX: :environment tabularx :width \linewidth :spread t :align Xrl
| School of Electrical Engineering & Computer Science | E-mail: | [[mailto:plin1@eecs.wsu.edu][plin1@eecs.wsu.edu]] |
| Washington State University                         | Phone:  | (509) 339-4050     |
| P.O. Box 642752                                     |         |                    |
| Pullman, WA 99164-2752                              |         |                    |

** Education
#+ATTR_LaTeX: :environment tabularx :width \linewidth :spread t :align lXr
| 2015.8-present | *Washington State University*                                   | *WSU* |
|                | PhD student in Computer Science                                 |       |
|                | Advisor: \href{http://eecs.wsu.edu/~yinghui/}{Yinghui Wu}       |       |
|                | Research fields: Big Data, Graph Data, Data Mining              |       |
|                | Current project: graph association rule mining and applications |       |
  
#+ATTR_LaTeX: :environment tabularx :width \linewidth :spread t :align lXr
| 2009.9-2012.3 | *Shanghai Jiao Tong University*                                 | *SJTU* |
|               | Master of Science in Control Science and Engineering            |        |
|               | Advisor: Yuming Zhao & Fuqiao Hu                                |        |
|               | Research fields: Computer Vision & Machine Learning             |        |
|               | Thesis: body part recognition based on depth images by learning |        |

#+ATTR_LaTeX: :environment tabularx :width \linewidth :spread t :align lXr
| 2005.9-2009.6 | *Shanghai Jiao Tong University*                                             | *SJTU* |
|               | Bachelor of Science in Automation                                           |        |
|               | Thesis: the analysis and design of transfer function in 3d volume rendering |        |

** Research & Projects
#+ATTR_LaTeX: :environment tabularx :width \linewidth :spread t :align lX
| 2015.11-present | *Graph Association Rule Mining and Applications*: /Current Project at/ WSU. The project is to study association rule mining and its applications. One application is temporal *event detection*, which is to analyze the significant patterns over temporal graph data. The work is based on efficient and effective graph matching and mining algorithms, and it extends static graph mining to predict the interesting patterns over temporal graphs. The initial work was built on Spark/GraphX. Another application is *knowledge graph quality and cleaning*. Association rules can be applied as error detection rules and data cleaning rules over large-scale knowledge graphs. We are developing (distributed) quality rule mining, error detection and data cleaning techniques using association rules. |
| 2014.04-2015.07 | *Color non-uniformity correction*: /Research Project at/ Marvell. I researched and designed a color correction method, which used PCA to compress massive features and then optimized to the minimal entropy. See draft: @@latex:{\href{https://docs.google.com/viewer?a=v&pid=sites&srcid=ZGVmYXVsdGRvbWFpbnxwZW5nbGluMDN8Z3g6N2M0OGZkNWNlY2E4MzY1MA}{PDF}}@@. Also, in order to run algorithms on embedded systems with limited resources, I built a standalone matrix library with numerical stability for embedded systems. See @@latex:{\href{https://github.com/penglin03/Numic}{code}}@@                                                                                                                                                                                                                    |
| 2011.03-2012.03 | *Human body part recognition*: /Master's project at/ SJTU. The motivation of this project was to do fast recognition. I investigated and implemented a human body part recognition algorithm, by the techniques of depth imaging and ensemble learning. Compared with geometry based methods, the algorithm used less context but gained real time performance.                                                                                                                                                                                                                                                                                                                                                                                                                                                    |

** Work Experience
#+ATTR_LaTeX: :environment tabularx :width \linewidth :spread t :align lXr
| 2012.4-2015.07 | *Software Engineer at Marvell Technology Group Ltd.*              | Shanghai, China |
|                | Focus: design algorithms for mobile phone camera        |                 |
| 2011.5-2011.11 | *Software Intern at Intel Corporation Ltd.*                       | Shanghai, China |
|                | Focus: system administrator on Xen servers                        |                 |
| 2010.7-2010.10 | *Software Intern at Omron Corporation Ltd.*                       | Shanghai, China |
|                | Focus: designer of Omron's exhibition at World Expo 2010 Shanghai |                 |

** Technical Skills
#+ATTR_LaTeX: :environment tabularx :width \linewidth :spread t :align p{1in}X
| Programming Languages        | C/C++, Java, Scala, Python, Lisp, C#, R, Matlab/Octave with practical experience.                                                                                          |
|                              |                                                                                                                                                                            |
| Proficient Tools & Libraries | Apache/Spark, Weka, Linux, GCC, Bash, Git, Html/CSS, JSON, Xml (libxml2), OpenCV, OpenGL (freeglut), LaTeX                                                                 |
|                              |                                                                                                                                                                            |
| Specialized Knowledge        | Database and Data mining, Machine Learning, Computer Vision, Numerical Computing, Functional Programming, Optics & Color Science, Embedded System |

** Publications
   + *Peng Lin*, Chao Zhang, Zhuliang Li, Yuming Zhao, Human Body Part
     Recognition Based on Depth Image Learning[J], Computer Engineering, Vol.38
     (16), pp.185-188, 2012, DOI: 10.3969/j.issn.1000-3428.2012.16.048. (In
     Chinese) [[[https://drive.google.com/viewerng/viewer?a=v&pid=sites&srcid=ZGVmYXVsdGRvbWFpbnxwZW5nbGluMDN8Z3g6MmZhYzU4NjM1NDlkMjg1Mw][PDF]]]
   + Ling Cai, \textbf{Peng Lin}, Yuming Zhao, Chenghua Wang, Texture Image
     Segmentation by Active Bayesian Contour, International Conference on
     System Design and Data Processing (ICSDDP), Taiyuan, Shanxi, pp.357-360,
     2011.2. [[[https://drive.google.com/viewerng/viewer?a=v&pid=sites&srcid=ZGVmYXVsdGRvbWFpbnxwZW5nbGluMDN8Z3g6NzYwYzEzZTViNGRmY2NjYg][PDF]]]

** Honors & Awards
#+ATTR_LaTeX: :environment tabularx :width \linewidth :spread t :align lXr
| 2011-2012 | Graduate Fellowship                                       | SJTU       |
| 2008-2009 | National Encouragement Scholarship                        | MoE, China |
| 2007-2008 | Scholarship of Rockwell (top 3/108)                       | Rockwell   |
| 2006-2007 | Merit Student of the Year (top 1/29)                      | SJTU       |
| 2006-2008 | Academic Excellence Scholarship                           | SJTU       |
| 2003-2004 | First Prize in National Mathematical Olympiad Competition | CMS, China |

** Teaching Experience
#+ATTR_LaTeX: :environment tabularx :width \linewidth :spread t :align lX
| Spring 2016 WSU | TA, CptS 360: Systems Programming                |
| Fall 2015, WSU  | TA, CptS 355: Programming Language Design        |
| Fall 2010, SJTU | TA, AU 311: Pattern Recognition                  |
| 2009-2011, SJTU | Instructor, a class of 27 undergraduate students |

** Selected Courses
#+ATTR_LaTeX: :environment tabularx :width \linewidth :spread t :align p{0.6in}X
| WSU  | Machine Learning, Advanced Database, Algorithmics, Big Data, Data Science  |
| SJTU | Artificial Intelligence, Pattern Recognition, Artificial Neural Network    |
|      | Mathematical Analysis, Discrete Mathematics, Data Structure and Algorithms |
