Peng Lin-resume.tex
% Created 2016-02-25 Thu 15:52
\documentclass[10pt, a4paper]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage[margin=0.75in]{geometry}
\usepackage{tabularx}
\usepackage{sectsty}
\usepackage{color}
\definecolor{linkcolour}{rgb}{0,0.2,0.6}
\hypersetup{colorlinks,breaklinks, urlcolor=linkcolour,linkcolor=linkcolour}
\author{plin1}
\date{\today}
\title{}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 24.5.1 (Org mode 8.2.10)}}
\begin{document}

\pagestyle{empty}
\setlength{\parindent}{0cm}

\sectionfont{
  \huge\bfseries
}

\subsectionfont{
  \sectionrule{0pt}{0pt}{-5pt}{0.8pt}
}

\section*{Peng Lin}
\label{sec-1}
\begin{center}
\begin{tabularx}{\linewidth}{Xrl}
School of Electrical Engineering \& Computer Science & E-mail: & \href{mailto:plin1@eecs.wsu.edu}{plin1@eecs.wsu.edu}\\
Washington State University & Phone: & (509) 339-4050\\
P.O. Box 642752 &  & \\
Pullman, WA 99164-2752 &  & \\
\end{tabularx}
\end{center}

\subsection*{Education}
\label{sec-1-1}
\begin{center}
\begin{tabularx}{\linewidth}{lXr}
2015.8-present & \textbf{Washington State University} & \textbf{WSU}\\
 & PhD student in Computer Science & \\
 & Advisor: \href{http://eecs.wsu.edu/~yinghui/}{Yinghui Wu} & \\
 & Research fields: Big Data, Graph Data, Data Mining & \\
 & Current project: graph association rule mining and applications & \\
\end{tabularx}
\end{center}

\begin{center}
\begin{tabularx}{\linewidth}{lXr}
2009.9-2012.3 & \textbf{Shanghai Jiao Tong University} & \textbf{SJTU}\\
 & Master of Science in Control Science and Engineering & \\
 & Advisor: Yuming Zhao \& Fuqiao Hu & \\
 & Research fields: Computer Vision \& Machine Learning & \\
 & Thesis: body part recognition based on depth images by learning & \\
\end{tabularx}
\end{center}

\begin{center}
\begin{tabularx}{\linewidth}{lXr}
2005.9-2009.6 & \textbf{Shanghai Jiao Tong University} & \textbf{SJTU}\\
 & Bachelor of Science in Automation & \\
 & Thesis: the analysis and design of transfer function in 3d volume rendering & \\
\end{tabularx}
\end{center}

\subsection*{Research \& Projects}
\label{sec-1-2}
\begin{center}
\begin{tabularx}{\linewidth}{lX}
2015.11-present & \textbf{Graph Association Rule Mining and Applications}: \emph{Current Project at} WSU. The project is to study association rule mining and its applications. One application is temporal \textbf{event detection}, which is to analyze the significant patterns over temporal graph data. The work is based on efficient and effective graph matching and mining algorithms, and it extends static graph mining to predict the interesting patterns over temporal graphs. The initial work was built on Spark/GraphX. Another application is \textbf{knowledge graph quality and cleaning}. Association rules can be applied as error detection rules and data cleaning rules over large-scale knowledge graphs. We are developing (distributed) quality rule mining, error detection and data cleaning techniques using association rules.\\
2014.04-2015.07 & \textbf{Color non-uniformity correction}: \emph{Research Project at} Marvell. I researched and designed a color correction method, which used PCA to compress massive features and then optimized to the minimal entropy. See draft: {\href{https://docs.google.com/viewer?a=v&pid=sites&srcid=ZGVmYXVsdGRvbWFpbnxwZW5nbGluMDN8Z3g6N2M0OGZkNWNlY2E4MzY1MA}{PDF}}. Also, in order to run algorithms on embedded systems with limited resources, I built a standalone matrix library with numerical stability for embedded systems. See {\href{https://github.com/penglin03/Numic}{code}}\\
2011.03-2012.03 & \textbf{Human body part recognition}: \emph{Master's project at} SJTU. The motivation of this project was to do fast recognition. I investigated and implemented a human body part recognition algorithm, by the techniques of depth imaging and ensemble learning. Compared with geometry based methods, the algorithm used less context but gained real time performance.\\
\end{tabularx}
\end{center}

\subsection*{Work Experience}
\label{sec-1-3}
\begin{center}
\begin{tabularx}{\linewidth}{lXr}
2012.4-2015.07 & \textbf{Software Engineer at Marvell Technology Group Ltd.} & Shanghai, China\\
 & Focus: design algorithms for mobile phone camera & \\
2011.5-2011.11 & \textbf{Software Intern at Intel Corporation Ltd.} & Shanghai, China\\
 & Focus: system administrator on Xen servers & \\
2010.7-2010.10 & \textbf{Software Intern at Omron Corporation Ltd.} & Shanghai, China\\
 & Focus: designer of Omron's exhibition at World Expo 2010 Shanghai & \\
\end{tabularx}
\end{center}

\subsection*{Technical Skills}
\label{sec-1-4}
\begin{center}
\begin{tabularx}{\linewidth}{p{1in}X}
Programming Languages & C/C++, Java, Scala, Python, Lisp, C\#, R, Matlab/Octave with practical experience.\\
 & \\
Proficient Tools \& Libraries & Apache/Spark, Weka, Linux, GCC, Bash, Git, Html/CSS, JSON, Xml (libxml2), OpenCV, OpenGL (freeglut), \LaTeX{}\\
 & \\
Specialized Knowledge & Database and Data mining, Machine Learning, Computer Vision, Numerical Computing, Functional Programming, Optics \& Color Science, Embedded System\\
\end{tabularx}
\end{center}

\subsection*{Publications}
\label{sec-1-5}
\begin{itemize}
\item \textbf{Peng Lin}, Chao Zhang, Zhuliang Li, Yuming Zhao, Human Body Part
Recognition Based on Depth Image Learning[J], Computer Engineering, Vol.38
(16), pp.185-188, 2012, DOI: 10.3969/j.issn.1000-3428.2012.16.048. (In
Chinese) [\href{https://drive.google.com/viewerng/viewer?a=v&pid=sites&srcid=ZGVmYXVsdGRvbWFpbnxwZW5nbGluMDN8Z3g6MmZhYzU4NjM1NDlkMjg1Mw}{PDF}]
\item Ling Cai, \textbf{Peng Lin}, Yuming Zhao, Chenghua Wang, Texture Image
Segmentation by Active Bayesian Contour, International Conference on
System Design and Data Processing (ICSDDP), Taiyuan, Shanxi, pp.357-360,
2011.2. [\href{https://drive.google.com/viewerng/viewer?a=v&pid=sites&srcid=ZGVmYXVsdGRvbWFpbnxwZW5nbGluMDN8Z3g6NzYwYzEzZTViNGRmY2NjYg}{PDF}]
\end{itemize}

\subsection*{Honors \& Awards}
\label{sec-1-6}
\begin{center}
\begin{tabularx}{\linewidth}{lXr}
2011-2012 & Graduate Fellowship & SJTU\\
2008-2009 & National Encouragement Scholarship & MoE, China\\
2007-2008 & Scholarship of Rockwell (top 3/108) & Rockwell\\
2006-2007 & Merit Student of the Year (top 1/29) & SJTU\\
2006-2008 & Academic Excellence Scholarship & SJTU\\
2003-2004 & First Prize in National Mathematical Olympiad Competition & CMS, China\\
\end{tabularx}
\end{center}

\subsection*{Teaching Experience}
\label{sec-1-7}
\begin{center}
\begin{tabularx}{\linewidth}{lX}
Spring 2016 WSU & TA, CptS 360: Systems Programming\\
Fall 2015, WSU & TA, CptS 355: Programming Language Design\\
Fall 2010, SJTU & TA, AU 311: Pattern Recognition\\
2009-2011, SJTU & Instructor, a class of 27 undergraduate students\\
\end{tabularx}
\end{center}

\subsection*{Selected Courses}
\label{sec-1-8}
\begin{center}
\begin{tabularx}{\linewidth}{p{0.6in}X}
WSU & Machine Learning, Advanced Database, Algorithmics, Big Data, Data Science\\
SJTU & Artificial Intelligence, Pattern Recognition, Artificial Neural Network\\
 & Mathematical Analysis, Discrete Mathematics, Data Structure and Algorithms\\
\end{tabularx}
\end{center}
% Emacs 24.5.1 (Org mode 8.2.10)
\end{document}